{"keras_version": "2.1.2", "backend": "tensorflow", "config": [{"config": {"name": "conv2d_1", "batch_input_shape": [null, 50, 50, 3], "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "padding": "valid", "filters": 32, "dtype": "float32", "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "use_bias": true, "strides": [1, 1], "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_2", "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "filters": 32, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "activation": "relu", "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "units": 128, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dense_2", "activation": "sigmoid", "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "units": 1, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential"}